In [53]:
# Definition=
# As long as more than one columns of an exel sheet, then it is called data sheet

## Import

In [54]:
import numpy as np # numpy same as np
import pandas as pd # pandas same as pd

# Creating a Dataframe

In [55]:
mydata = np.random.randint(0,101,(4,3))#4x3||4 is row 3 is column
my_index = ['CA','NY','AZ','TX']
my_col = ['Jan','Feb','Mar'] # col is column for short
df=pd.DataFrame(data=mydata,index=my_index,columns=my_col)#df is dataframe
df

    Jan  Feb  Mar
CA    8   95   10
NY   49   12   83
AZ   20   49   44
TX   37   38    2

# Read .csv file

In [56]:
df = pd.read_csv('tips.csv')
df
# a smart display system that displays the first 5 and last 5 lines as some 
# files can have millions and could be way to long
# FOR COLUMNS there are 11 different features/data including the column is 12
# FOR ROWS not including title row is 244

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

### Assingment 1. import read .csv file(basketball file) 2. Explain a details of features everysingle one. 3. Comepeup with an idea of a description of the dataset(objective truth no sujective truth) 4. According to the basketball datasets... Propose a study on at least 2 topics you can research

In [57]:
# Read the NBA .csv File

In [58]:
# Explain the details of the features

## There are 25 head columns
# Column Descriptions
# Player: Name of the player.
#Tm: Abbreviation of the player's team.
#Opp: Abbreviation of the opposing team.
#Res: Result of the game for the player's team.
#MP: Minutes played, represented as a float (e.g., 23.5 = 23 minutes and 30 seconds).
#FG: Field goals made.
#FGA: Field goal attempts.
#FG%: Field goal percentage.
#3P: 3-point field goals made.
#3PA: 3-point field goal attempts.
#3P%: 3-point shooting percentage.
#FT: Free throws made.
#FTA: Free throw attempts.
#FT%: Free throw percentage.
#ORB: Offensive rebounds.
#DRB: Defensive rebounds.
#TRB: Total rebounds.
#AST: Assists.
#3STL: Steals.
#BLK: Blocks.
#TOV: Turnovers.
#PF: Personal fouls.
#PTS: Total points scored.
#GmSc: Game Score, a metric summarizing player performance for the game.
#Data: Date of the game in YYYY-MM-DD format.

In [59]:
# Write the description of the dataset (Objective truth)

# The dataset includes detailed performance stats for NBA players from the 2024–2025
# season. It covers both basic stats (like points and rebounds) and advanced
# metrics (such as efficiency ratings), making it perfect for analyzing how players
# are performing, comparing their stats, and spotting trends over the season.
# The data is on Every single player in the NBA during the 24-25 season.
# It’s good for looking into player performance analysis,
# track trends, or predict future outcomes.

In [60]:
# According to the study of our dataset, propose at least two topics that I can
#  research through our dataset.

#/// 1. First topic: The impact of minutes played on player efficentcy. So
# If one player has a great game say 30 pts and a triple double. How does that affect
# the next game they will play? Will they perform the same or perform significantly
# worse due to fatigue and how does that affect the teams win and loss count

#// Second topic:  Shooting efficentcy vs. Shot Volume
# This topic looks at whether players who take more shots still make them 
# at a high rate. It lools if shooting a lot makes a player less accurate, 
# or if some players can keep scoring well even with more attempts.

# DataFrames

## Obtaining Basic Information About DataFrame

In [61]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [62]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [63]:
df.head(3)#this will print the first numbers. On default without any numbers
#e.g.(3) it will print the first 5

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458

In [64]:
df.tail(3)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [65]:
len(df)  # This gives the number of rows

244

In [66]:
len(df.columns) # This prints the number of columns

11

# Selction and Indexing

In [67]:
# Grab a single column

### Grab a single column

In [68]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [69]:
df['sex']

0      Female
1        Male
2        Male
3        Male
4      Female
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 244, dtype: object

In [70]:
df['total_bill'].head(9) # combines the two together

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
5    25.29
6     8.77
7    26.88
8    15.04
Name: total_bill, dtype: float64

In [71]:
type(df['total_bill'])

pandas.core.series.Series

### Grab Multiple Columns

In [72]:
# Note how its a python list of column names!  Thus the double brackets.
df[['total_bill','tip','sex']]

     total_bill   tip     sex
0         16.99  1.01  Female
1         10.34  1.66    Male
2         21.01  3.50    Male
3         23.68  3.31    Male
4         24.59  3.61  Female
..          ...   ...     ...
239       29.03  5.92    Male
240       27.18  2.00  Female
241       22.67  2.00    Male
242       17.82  1.75    Male
243       18.78  3.00  Female

[244 rows x 3 columns]

# Creating a New Feature

In [73]:
df['tip_percentage'] = 100

In [74]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,100
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,100
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,100
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,100
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,100

##

In [75]:
df['tip_percentage'] = 100* df['tip'] / df['total_bill']

In [76]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

## Adjust Existing Column

In [78]:
df['price_per_person'] = np.round(df['price_per_person'],1)

In [79]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251,14.680765

In [ ]:
# df.drop('tip_percentage',axis=1)

In [80]:
df = df.drop("tip_percentage",axis=1)

In [81]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251

# Set Index

In [83]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [86]:
df.set_index('Payment ID')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.7,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.6,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.3,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.9,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.4,Michelle Hardin,3511451626698139

# Reset Index

In [87]:
df = df.reset_index()

In [88]:
df.head()

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260
4,4,24.59,3.61,Female,No,Sun,Dinner,4,6.2,Tonya Carter,4832732618637221,Sun2251

# Grab a Single Row

In [89]:
# Integer Based
df.iloc[0]

index                                0
total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                   8.5
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 0, dtype: object

# Grab Multiple Rows

In [91]:
df.iloc[0:4]

,index,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,0,16.99,1.01,Female,No,Sun,Dinner,2,8.5,Christy Cunningham,3560325168603410,Sun2959
1,1,10.34,1.66,Male,No,Sun,Dinner,3,3.4,Douglas Tucker,4478071379779230,Sun4608
2,2,21.01,3.50,Male,No,Sun,Dinner,3,7.0,Travis Walters,6011812112971322,Sun4458
3,3,23.68,3.31,Male,No,Sun,Dinner,2,11.8,Nathaniel Harris,4676137647685994,Sun5260

# Remove a Row

In [ ]:
df.drop('Sun2959',axis)